OpenFOAM-v2112/tutorials/combustion/reactingFoam/RAS/membrane/0.orig/include
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      include;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sleeve
{
    CH4 0;
    N2  0.79;
    O2  0.21;
}

pipe
{
    CH4 0.5;
    O2  0;
    N2  0.5;
}


// ************************************************************************* //
